Terraform plan for __staging__
<details>
<summary>Plan: 20 to add, 0 to change, 8 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.inventory_events.google_pubsub_subscription.pull_subscriptions["inventory-management-view"] will be created
  + resource "google_pubsub_subscription" "pull_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "inventory-management-view"
      + project                    = "ebo-staging"
      + topic                      = "inventory-management"

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # module.inventory_events.google_pubsub_subscription_iam_member.pull_subscription_binding["inventory-management-view"] will be created
  + resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ebo-staging"
      + role         = "roles/pubsub.subscriber"
      + subscription = "inventory-management-view"
    }

  # module.order-notification-grn.data.google_project.project will be read during apply
  # (config refers to values not yet known)
 <= data "google_project" "project"  {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      ~ id                  = "********************" -> (known after apply)
      ~ labels              = {} -> (known after apply)
      ~ name                = "ebo-staging" -> (known after apply)
      ~ number              = "770633633132" -> (known after apply)
      + org_id              = (known after apply)
      + skip_delete         = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.order-notification-grn.google_project_iam_member.token_creator_binding[0] must be replaced
-/+ resource "google_project_iam_member" "token_creator_binding" {
      ~ etag    = "BwXZYpeSAOo=" -> (known after apply)
      ~ id      = "**************************************************************************************************************************" -> (known after apply)
      ~ member  = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.order-notification-grn.google_pubsub_subscription_iam_member.push_subscription_binding["order-notification-grn-push"] must be replaced
-/+ resource "google_pubsub_subscription_iam_member" "push_subscription_binding" {
      ~ etag         = "BwXW9MM4QEw=" -> (known after apply)
      ~ id           = "****************************************************************************************************************************************************************" -> (known after apply)
      ~ member       = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.order-notification-grn.google_pubsub_topic_iam_member.push_topic_binding["order-notification-grn-push"] must be replaced
-/+ resource "google_pubsub_topic_iam_member" "push_topic_binding" {
      ~ etag    = "BwXW9K2sQJ0=" -> (known after apply)
      ~ id      = "******************************************************************************************************************************************************" -> (known after apply)
      ~ member  = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.order-notification-grn-dl.google_pubsub_subscription.pull_subscriptions["order-notification-grn-dl-error"] will be created
  + resource "google_pubsub_subscription" "pull_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "order-notification-grn-dl-error"
      + project                    = "ebo-staging"
      + topic                      = "order-notification-grn-dl"

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # module.order-notification-grn-dl.google_pubsub_subscription_iam_member.pull_subscription_binding["order-notification-grn-dl-error"] will be created
  + resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ebo-staging"
      + role         = "roles/pubsub.subscriber"
      + subscription = "order-notification-grn-dl-error"
    }

  # module.order-notification-ian.data.google_project.project will be read during apply
  # (config refers to values not yet known)
 <= data "google_project" "project"  {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      ~ id                  = "********************" -> (known after apply)
      ~ labels              = {} -> (known after apply)
      ~ name                = "ebo-staging" -> (known after apply)
      ~ number              = "770633633132" -> (known after apply)
      + org_id              = (known after apply)
      + skip_delete         = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.order-notification-ian.google_project_iam_member.token_creator_binding[0] must be replaced
-/+ resource "google_project_iam_member" "token_creator_binding" {
      ~ etag    = "BwXZYpeSAOo=" -> (known after apply)
      ~ id      = "**************************************************************************************************************************" -> (known after apply)
      ~ member  = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.order-notification-ian.google_pubsub_subscription_iam_member.push_subscription_binding["order-notification-ian-push"] must be replaced
-/+ resource "google_pubsub_subscription_iam_member" "push_subscription_binding" {
      ~ etag         = "BwXW9MM+UMA=" -> (known after apply)
      ~ id           = "****************************************************************************************************************************************************************" -> (known after apply)
      ~ member       = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.order-notification-ian.google_pubsub_topic_iam_member.push_topic_binding["order-notification-ian-push"] must be replaced
-/+ resource "google_pubsub_topic_iam_member" "push_topic_binding" {
      ~ etag    = "BwXW9K3plbo=" -> (known after apply)
      ~ id      = "******************************************************************************************************************************************************" -> (known after apply)
      ~ member  = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.order-notification-ian-dl.google_pubsub_subscription.pull_subscriptions["order-notification-ian-dl-error"] will be created
  + resource "google_pubsub_subscription" "pull_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "order-notification-ian-dl-error"
      + project                    = "ebo-staging"
      + topic                      = "order-notification-ian-dl"

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # module.order-notification-ian-dl.google_pubsub_subscription_iam_member.pull_subscription_binding["order-notification-ian-dl-error"] will be created
  + resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ebo-staging"
      + role         = "roles/pubsub.subscriber"
      + subscription = "order-notification-ian-dl-error"
    }

  # module.order-notification-ship.data.google_project.project will be read during apply
  # (config refers to values not yet known)
 <= data "google_project" "project"  {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      ~ id                  = "********************" -> (known after apply)
      ~ labels              = {} -> (known after apply)
      ~ name                = "ebo-staging" -> (known after apply)
      ~ number              = "770633633132" -> (known after apply)
      + org_id              = (known after apply)
      + skip_delete         = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.order-notification-ship.google_project_iam_member.token_creator_binding[0] must be replaced
-/+ resource "google_project_iam_member" "token_creator_binding" {
      ~ etag    = "BwXZYpeSAOo=" -> (known after apply)
      ~ id      = "**************************************************************************************************************************" -> (known after apply)
      ~ member  = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.order-notification-ship.google_pubsub_subscription.push_subscriptions["order-notification-ship-push"] will be created
  + resource "google_pubsub_subscription" "push_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "order-notification-ship-push"
      + project                    = "ebo-staging"
      + topic                      = "order-notification-ship"

      + dead_letter_policy {
          + dead_letter_topic     = "projects/ebo-staging/topics/order-notification-ship-dl"
          + max_delivery_attempts = 7
        }

      + expiration_policy {
          + ttl = (known after apply)
        }

      + push_config {
          + push_endpoint = "https://services-staging.ibo.com/common/v1/resource"
        }

      + retry_policy {
          + maximum_backoff = "600s"
          + minimum_backoff = "300s"
        }
    }

  # module.order-notification-ship.google_pubsub_subscription_iam_member.push_subscription_binding["order-notification-ship-push"] will be created
  + resource "google_pubsub_subscription_iam_member" "push_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + project      = "ebo-staging"
      + role         = "roles/pubsub.subscriber"
      + subscription = "order-notification-ship-push"
    }

  # module.order-notification-ship.google_pubsub_topic_iam_member.push_topic_binding["order-notification-ship-push"] must be replaced
-/+ resource "google_pubsub_topic_iam_member" "push_topic_binding" {
      ~ etag    = "BwXW9K2nl/M=" -> (known after apply)
      ~ id      = "*******************************************************************************************************************************************************" -> (known after apply)
      ~ member  = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (3 unchanged attributes hidden)
    }

  # module.order-notification-ship-dl.google_pubsub_subscription.pull_subscriptions["order-notification-ship-dl-error"] will be created
  + resource "google_pubsub_subscription" "pull_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "order-notification-ship-dl-error"
      + project                    = "ebo-staging"
      + topic                      = "order-notification-ship-dl"

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # module.order-notification-ship-dl.google_pubsub_subscription_iam_member.pull_subscription_binding["order-notification-ship-dl-error"] will be created
  + resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ebo-staging"
      + role         = "roles/pubsub.subscriber"
      + subscription = "order-notification-ship-dl-error"
    }

  # module.payment_events.google_pubsub_subscription.pull_subscriptions["payments-internal-payment-events-subscription"] will be created
  + resource "google_pubsub_subscription" "pull_subscriptions" {
      + ack_deadline_seconds       = 10
      + id                         = (known after apply)
      + message_retention_duration = "604800s"
      + name                       = "payments-internal-payment-events-subscription"
      + project                    = "ebo-staging"
      + topic                      = "payment-events"

      + expiration_policy {
          + ttl = (known after apply)
        }
    }

  # module.payment_events.google_pubsub_subscription_iam_member.pull_subscription_binding["payments-internal-payment-events-subscription"] will be created
  + resource "google_pubsub_subscription_iam_member" "pull_subscription_binding" {
      + etag         = (known after apply)
      + id           = (known after apply)
      + member       = "serviceAccount:service-770633633132@gcp-sa-pubsub.iam.gserviceaccount.com"
      + project      = "ebo-staging"
      + role         = "roles/pubsub.subscriber"
      + subscription = "payments-internal-payment-events-subscription"
    }

Plan: 20 to add, 0 to change, 8 to destroy.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

:memo: Plan generated in [Terraform #479](https://github.com/ebomart/commerce-infrastructure/actions/runs/1943781789)